N, k = map(int, input().split()) # N - кол-во чисел k - по сколько чисел берем для суммы
A = [int(n) for n in input().split()]
s=0

for i in range(k): # считаем самую первую сумму
    s+=A[i]
print(s) # выводим посчитанную сумму

i, j = 0, k-1 # создаем 2 указателя между которомы диапозон k

while j < N-1: # пока правый указатель не дошел до конца массива
    s = s - A[i] + A[j+1] # считаем текущую сумму (прошлая сумма - текущий элемент + следующий элемент)
    print(s) # выводим посчитанную сумму
    # передвигаем указатели
    i+=1
    j+=1